Revit 2024 API
AnalyticalToPhysicalAssociationManager.GetAnalyticalToPhysicalAssociationManager Method
 Returns the AnalyticalToPhysicalAssociationManager for this document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static AnalyticalToPhysicalAssociationManager GetAnalyticalToPhysicalAssociationManager(
	Document doc
)
Visual Basic
Public Shared Function GetAnalyticalToPhysicalAssociationManager ( _
	doc As Document _
) As AnalyticalToPhysicalAssociationManager
Visual C++
public:
static AnalyticalToPhysicalAssociationManager^ GetAnalyticalToPhysicalAssociationManager(
	Document^ doc
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 Revit document.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace